# 1) Написать функцию на замыкания которая будет в себе хранить лист дел, вам нужно реализовать два метода
# - первый записывает в эту переменную запись
# - второй возвращает все записи
#
# запишите 5 тудушек
# и выведете все

# def notebook():
#
#     todo_list = []
#
#     def add_todo(todo):
#         todo_list.append(todo)
#
#     def get_all():
#         return todo_list
#
#     return {
#         "get_all": get_all,
#         "add_todo": add_todo
#     }
#
# notebook1 = notebook()
# notebook1['add_todo']("first")
# notebook1['add_todo']("second")
# notebook1['add_todo']("third")
# notebook1['add_todo']("fourth")
# notebook1['add_todo']("fifth")
# print(notebook1.get('get_all')())
#####################################################################################
# 2) протипизировать первое задание

# a, b, c, d, e = notebook1.get('get_all')()
# print(a, b, c, d, e)
#
# a, b = "NOT first", "NOT second"
# a, b = b, a
# print(a, b, c, d, e)
#####################################################################################
# 3) С помощью lambda функции извлеките из списка числа, делимые на 15 без остатка.

# list1 = [76, 60, 45, 89, 100, 105]
# print(list(filter(lambda x: x % 15 == 0, list1)))
#####################################################################################
# 4) написать функцию которая будет принимать целое число n и посчитайте n + nn + nnn.
# Пример:
# summ(7) -> 7+77+777=861

# def func(n):
#     n1 = n
#     n2 = int(str(n) * 2)
#     n3 = int(str(n) * 3)
#     print(n1 + n2 + n3)
# func(7)
#####################################################################################
#####################################################################################
#####################################################################################
# создать функцию которая будет возвращать сумму разрядов числа в виде строки
#
# Пример:
#
# expanded_form(12) # return '10 + 2'
# expanded_form(42) # return '40 + 2'
# expanded_form(70304) # return '70000 + 300 + 4'

# def form(x):                                                                        #<-- Числа тільки до 109
#     a = x // 10 * 10
#     b = x % 10
#     print(f"'{a}' + '{b}'")
# form(99)
#####################################################################################
# создать функцию которая будет выводить сколько и каких символов в строке
# пример:
#
# st = 'as 23 fdfdg544'
#
# 'a' -> 1
# 's' -> 1
# ' ' -> 2
# '2' -> 1
# '3' -> 1
# 'f' -> 2
# 'd' -> 2
# 'g' -> 1
# '5' -> 1
# '4' -> 2

# def count_(st):
#     list1=[]
#
#     for digits in st:
#         if digits not in list1:
#             list1.append(digits)
#
#     for item in list1:
#         print(f"'{item}' -> {st.count(item)}")
#
# count_('as 23 fdfdg544')